/*
 Обработка ошибок

 В этом задании вам потребуется вернуться к предыдущей домашней работе, в которой вы создавали ПО для дилерских центров.

 Задача №1

 Алгоритм выполнения

 Внесите изменения в метод 'makeSpecialOffer()' таким образом, чтобы он возвращал ошибку, если машина не соответствует требованиям акции.
 В случае, если нет ошибки, сделайте для этой машины специальное предложение.
 Проверьте текущий список машин, чтобы при проверке генерировались ошибки. При необходимости, внесите изменения.
 Обработайте ошибки.

 Задача №2

 Алгоритм выполнения

 Перейдите к той части кода, где вы выполняли следующее задание: "Проверьте все машины в дилерском центре (склад + автосалон), возможно они нуждаются в специальном предложении. Если есть машины со скидкой на складе, нужно перегнать их в автосалон."
 Аналогично первой задаче, внесите изменения в код таким образом, чтобы осуществлялся возврат ошибки в том случае, если машина со скидкой уже находится в автосалоне. В том случае, если ошибки нет, нужно перегнать машину в автосалон.
 Проверьте текущий список машин, чтобы при проверке генерировались ошибки. При необходимости, внесите изменения.
 Обработайте ошибки.

 Задача 3 * (задача со звездочкой, дополнительная)

 Это последнее домашнее задание в модуле "Продвинутые основы Swift". Эта задача поможет вам закрепить все темы, изученные в модулях с основами Swift, и перейти далее, непосредственно к процессу разработки.

 Часть 1

 Детально ознакомьтесь с проектом, посмотрите все файлы и научитесь запускать проект. Расширьте протокол Weapons (например, закоментированное свойство) и используйте его по назначению, например, в расчете попал/не попал. Или вы можете расширить новый метод, который как-то влияет на поведение оружия.

 Алгоритм выполнения

 Раскомментируйте код со свойством, добавьте новое свойство или новый метод;
 Напишите комментарий, для каких целей вы расширили протокол;
 Добавьте необходимые поля или методы для реализации обновленного протокола;
 Найдите, где используются сущности, реализующие протокол Weapons;
 Придумайте, каким образом их можно применить для найденных участков кода;
 Запустите и понаблюдайте за тем, каким образом изменится ход "сражения".

 Часть 2

 Измените ход игры любым способом (создайте новое оружие, улучшите систему оповещения, новый корабль или их количество);
 Напишите отчет о том, что вы поняли/в чем разобрались, выполняя это задание;
 Дайте оценку своему пониманию данной темы.
 Данное задание поможет вам лучше понять эту тему. В процессе написания отчета вы выявите слабые и сильные места в изучении данной темы, закроете пробелы или у вас появятся новые вопросы. При возникновении вопросов можете писать в чат учебной группы.

 
 Правила выполнения домашней работы:

 Задачу 1 и2 можно выполнить и сдать в файле .playground, подписанный в формате ФамилияГруппаHW3_3 (например, IvanovIOS6_HW3_3.playground). Файл нужно заархивировать и загрузить в личном кабинете в формате .zip
 Выполняйте задачу 3 в проекте, который лежит в папке StarWars for iOS. Готовый проект заархивируйте и загрузите в личном кабинете в формате .zip, подписанный в формате ФамилияГруппаHW3_4 (например, IvanovIOS5_HW3_4.zip).
 Все задачи обязательны к выполнению для получения зачета, кроме задач со звездочкой. Присылать на проверку можно каждую задачу по отдельности или все задачи вместе. Во время проверки по частям ваша домашняя работа будет со статусом "На доработке".
 Любые вопросы по решению задач задавайте в чате учебной группы (ссылку вы найдете в письме на вашей эл. почте).
 */
